ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U3xx/stm32u375xx.h
/*!< Memory & Instance aliases and base addresses for Non-Secure/Secure peripherals */
/*!< Memory base addresses for Secure peripherals */
#define FLASH_BASE                      FLASH_BASE_S
#define SRAM1_BASE                      SRAM1_BASE_S
#define SRAM2_BASE                      SRAM2_BASE_S

/*!< Instance aliases and base addresses for Secure peripherals */
#define ADC12_COMMON                    ADC12_COMMON_S
#define ADC12_COMMON_BASE               ADC12_COMMON_BASE_S
#define ADC1                            ADC1_S
#define ADC1_BASE                       ADC1_BASE_S
#define ADC2                            ADC2_S
#define ADC2_BASE                       ADC2_BASE_S
#define ADF1                            ADF1_S
#define ADF1_BASE                       ADF1_BASE_S
#define ADF1_Filter0                    ADF1_Filter0_S
#define ADF1_Filter0_BASE               ADF1_Filter0_BASE_S
#define COMP1                           COMP1_S
#define COMP1_BASE                      COMP1_BASE_S
#define COMP2                           COMP2_S
#define COMP2_BASE                      COMP2_BASE_S
#define COMP12_COMMON                   COMP12_COMMON_S
#define COMP12_COMMON_BASE              COMP12_BASE_S
#define CRC                             CRC_S
#define CRC_BASE                        CRC_BASE_S
#define CRS                             CRS_S
#define CRS_BASE                        CRS_BASE_S
#define DAC1                            DAC1_S
#define DAC1_BASE                       DAC1_BASE_S
#define DLYB_SDMMC1                     DLYB_SDMMC1_S
#define DLYB_SDMMC1_BASE                DLYB_SDMMC1_BASE_S
#define DLYB_OCTOSPI1                   DLYB_OCTOSPI1_S
#define DLYB_OCTOSPI1_BASE              DLYB_OCTOSPI1_BASE_S
#define EXTI                            EXTI_S
#define EXTI_BASE                       EXTI_BASE_S
#define FDCAN1                          FDCAN1_S
#define FDCAN1_BASE                     FDCAN1_BASE_S
#define FDCAN_CONFIG                    FDCAN_CONFIG_S
#define FDCAN_CONFIG_BASE               FDCAN_CONFIG_BASE_S
#define FLASH                           FLASH_S
#define FLASH_R_BASE                    FLASH_R_BASE_S
#define GPDMA1                          GPDMA1_S
#define GPDMA1_BASE                     GPDMA1_BASE_S
#define GPDMA1_Channel0                 GPDMA1_Channel0_S
#define GPDMA1_Channel0_BASE            GPDMA1_Channel0_BASE_S
#define GPDMA1_Channel1                 GPDMA1_Channel1_S
#define GPDMA1_Channel1_BASE            GPDMA1_Channel1_BASE_S
#define GPDMA1_Channel2                 GPDMA1_Channel2_S
#define GPDMA1_Channel2_BASE            GPDMA1_Channel2_BASE_S
#define GPDMA1_Channel3                 GPDMA1_Channel3_S
#define GPDMA1_Channel3_BASE            GPDMA1_Channel3_BASE_S
#define GPDMA1_Channel4                 GPDMA1_Channel4_S
#define GPDMA1_Channel4_BASE            GPDMA1_Channel4_BASE_S
#define GPDMA1_Channel5                 GPDMA1_Channel5_S
#define GPDMA1_Channel5_BASE            GPDMA1_Channel5_BASE_S
#define GPDMA1_Channel6                 GPDMA1_Channel6_S
#define GPDMA1_Channel6_BASE            GPDMA1_Channel6_BASE_S
#define GPDMA1_Channel7                 GPDMA1_Channel7_S
#define GPDMA1_Channel7_BASE            GPDMA1_Channel7_BASE_S
#define GPDMA1_Channel8                 GPDMA1_Channel8_S
#define GPDMA1_Channel8_BASE            GPDMA1_Channel8_BASE_S
#define GPDMA1_Channel9                 GPDMA1_Channel9_S
#define GPDMA1_Channel9_BASE            GPDMA1_Channel9_BASE_S
#define GPDMA1_Channel10                GPDMA1_Channel10_S
#define GPDMA1_Channel10_BASE           GPDMA1_Channel10_BASE_S
#define GPDMA1_Channel11                GPDMA1_Channel11_S
#define GPDMA1_Channel11_BASE           GPDMA1_Channel11_BASE_S
#define GPIOA                           GPIOA_S
#define GPIOA_BASE                      GPIOA_BASE_S
#define GPIOB                           GPIOB_S
#define GPIOB_BASE                      GPIOB_BASE_S
#define GPIOC                           GPIOC_S
#define GPIOC_BASE                      GPIOC_BASE_S
#define GPIOD                           GPIOD_S
#define GPIOD_BASE                      GPIOD_BASE_S
#define GPIOE                           GPIOE_S
#define GPIOE_BASE                      GPIOE_BASE_S
#define GPIOG                           GPIOG_S
#define GPIOG_BASE                      GPIOG_BASE_S
#define GPIOH                           GPIOH_S
#define GPIOH_BASE                      GPIOH_BASE_S
#define GTZC_MPCBB1                     GTZC_MPCBB1_S
#define GTZC_MPCBB1_BASE                GTZC_MPCBB1_BASE_S
#define GTZC_MPCBB2                     GTZC_MPCBB2_S
#define GTZC_MPCBB2_BASE                GTZC_MPCBB2_BASE_S
#define GTZC_TZSC1                      GTZC_TZSC1_S
#define GTZC_TZSC1_BASE                 GTZC_TZSC1_BASE_S
#define GTZC_TZIC1                      GTZC_TZIC1_S
#define GTZC_TZIC1_BASE                 GTZC_TZIC1_BASE_S
#define HASH                            HASH_S
#define HASH_BASE                       HASH_BASE_S
#define HASH_DIGEST                     HASH_DIGEST_S
#define HASH_DIGEST_BASE                HASH_DIGEST_BASE_S
#define I2C1                            I2C1_S
#define I2C1_BASE                       I2C1_BASE_S
#define I2C2                            I2C2_S
#define I2C2_BASE                       I2C2_BASE_S
#define I2C3                            I2C3_S
#define I2C3_BASE                       I2C3_BASE_S
#define I3C1                            I3C1_S
#define I3C1_BASE                       I3C1_BASE_S
#define I3C2                            I3C2_S
#define I3C2_BASE                       I3C2_BASE_S
#define ICACHE                          ICACHE_S
#define ICACHE_BASE                     ICACHE_BASE_S
#define IWDG                            IWDG_S
#define IWDG_BASE                       IWDG_BASE_S
#define LPTIM1                          LPTIM1_S
#define LPTIM1_BASE                     LPTIM1_BASE_S
#define LPTIM2                          LPTIM2_S
#define LPTIM2_BASE                     LPTIM2_BASE_S
#define LPTIM3                          LPTIM3_S
#define LPTIM3_BASE                     LPTIM3_BASE_S
#define LPTIM4                          LPTIM4_S
#define LPTIM4_BASE                     LPTIM4_BASE_S
#define LPUART1                         LPUART1_S
#define LPUART1_BASE                    LPUART1_BASE_S
#define OCTOSPI1                        OCTOSPI1_S
#define OCTOSPI1_R_BASE                 OCTOSPI1_R_BASE_S
#define OPAMP1                          OPAMP1_S
#define OPAMP1_BASE                     OPAMP1_BASE_S
#define OPAMP2                          OPAMP2_S
#define OPAMP2_BASE                     OPAMP2_BASE_S
#define OPAMP12_COMMON                  OPAMP12_COMMON_S
#define OPAMP12_COMMON_BASE             OPAMP12_COMMON_BASE_S
#define PKA                             PKA_S
#define PKA_BASE                        PKA_BASE_S
#define PKA_RAM_BASE                    PKA_RAM_BASE_S
#define PWR                             PWR_S
#define PWR_BASE                        PWR_BASE_S
#define RAMCFG_SRAM1                    RAMCFG_SRAM1_S
#define RAMCFG_SRAM1_BASE               RAMCFG_SRAM1_BASE_S
#define RAMCFG_SRAM2                    RAMCFG_SRAM2_S
#define RAMCFG_SRAM2_BASE               RAMCFG_SRAM2_BASE_S
#define RCC                             RCC_S
#define RCC_BASE                        RCC_BASE_S
#define RNG                             RNG_S
#define RNG_BASE                        RNG_BASE_S
#define RTC                             RTC_S
#define RTC_BASE                        RTC_BASE_S
#define SAI1                            SAI1_S
#define SAI1_BASE                       SAI1_BASE_S
#define SAI1_Block_A                    SAI1_Block_A_S
#define SAI1_Block_A_BASE               SAI1_Block_A_BASE_S
#define SAI1_Block_B                    SAI1_Block_B_S
#define SAI1_Block_B_BASE               SAI1_Block_B_BASE_S
#define SDMMC1                          SDMMC1_S
#define SDMMC1_BASE                     SDMMC1_BASE_S
#define SPI1                            SPI1_S
#define SPI1_BASE                       SPI1_BASE_S
#define SPI2                            SPI2_S
#define SPI2_BASE                       SPI2_BASE_S
#define SPI3                            SPI3_S
#define SPI3_BASE                       SPI3_BASE_S
#define SRAMCAN_BASE                    SRAMCAN_BASE_S
#define SYSCFG                          SYSCFG_S
#define SYSCFG_BASE                     SYSCFG_BASE_S
#define TAMP                            TAMP_S
#define TAMP_BASE                       TAMP_BASE_S
#define TIM1                            TIM1_S
#define TIM1_BASE                       TIM1_BASE_S
#define TIM2                            TIM2_S
#define TIM2_BASE                       TIM2_BASE_S
#define TIM3                            TIM3_S
#define TIM3_BASE                       TIM3_BASE_S
#define TIM4                            TIM4_S
#define TIM4_BASE                       TIM4_BASE_S
#define TIM6                            TIM6_S
#define TIM6_BASE                       TIM6_BASE_S
#define TIM7                            TIM7_S
#define TIM7_BASE                       TIM7_BASE_S
#define TIM15                           TIM15_S
#define TIM15_BASE                      TIM15_BASE_S
#define TIM16                           TIM16_S
#define TIM16_BASE                      TIM16_BASE_S
#define TIM17                           TIM17_S
#define TIM17_BASE                      TIM17_BASE_S
#define TSC                             TSC_S
#define TSC_BASE                        TSC_BASE_S
#define UART4                           UART4_S
#define UART4_BASE                      UART4_BASE_S
#define UART5                           UART5_S
#define UART5_BASE                      UART5_BASE_S
#define USART1                          USART1_S
#define USART1_BASE                     USART1_BASE_S
#define USART3                          USART3_S
#define USART3_BASE                     USART3_BASE_S
#define USB_DRD_FS                      USB_DRD_FS_S
#define USB_DRD_BASE                    USB_DRD_BASE_S
#define USB_DRD_PMAADDR                 USB_DRD_PMAADDR_S
#define USB_DRD_PMA_BUFF                USB_DRD_PMA_BUFF_S
#define VREFBUF                         VREFBUF_S
#define VREFBUF_BASE                    VREFBUF_BASE_S
#define WWDG                            WWDG_S
#define WWDG_BASE                       WWDG_BASE_S

#else /* CPU_IN_SECURE_STATE */
/*!< Memory base addresses for Secure peripherals */
#define FLASH_BASE                      FLASH_BASE_NS
#define SRAM1_BASE                      SRAM1_BASE_NS
#define SRAM2_BASE                      SRAM2_BASE_NS

/*!< Instance aliases and base addresses for Secure peripherals */
#define ADC12_COMMON                    ADC12_COMMON_NS
#define ADC12_COMMON_BASE               ADC12_COMMON_BASE_NS
#define ADC1                            ADC1_NS
#define ADC1_BASE                       ADC1_BASE_NS
#define ADC2                            ADC2_NS
#define ADC2_BASE                       ADC2_BASE_NS
#define ADF1                            ADF1_NS
#define ADF1_BASE                       ADF1_BASE_NS
#define ADF1_Filter0                    ADF1_Filter0_NS
#define ADF1_Filter0_BASE               ADF1_Filter0_BASE_NS
#define COMP1                           COMP1_NS
#define COMP1_BASE                      COMP1_BASE_NS
#define COMP2                           COMP2_NS
#define COMP2_BASE                      COMP2_BASE_NS
#define COMP12_COMMON                   COMP12_COMMON_NS
#define COMP12_COMMON_BASE              COMP12_BASE_NS
#define CRC                             CRC_NS
#define CRC_BASE                        CRC_BASE_NS
#define CRS                             CRS_NS
#define CRS_BASE                        CRS_BASE_NS
#define DAC1                            DAC1_NS
#define DAC1_BASE                       DAC1_BASE_NS
#define DLYB_SDMMC1                     DLYB_SDMMC1_NS
#define DLYB_SDMMC1_BASE                DLYB_SDMMC1_BASE_NS
#define DLYB_OCTOSPI1                   DLYB_OCTOSPI1_NS
#define DLYB_OCTOSPI1_BASE              DLYB_OCTOSPI1_BASE_NS
#define EXTI                            EXTI_NS
#define EXTI_BASE                       EXTI_BASE_NS
#define FDCAN1                          FDCAN1_NS
#define FDCAN1_BASE                     FDCAN1_BASE_NS
#define FDCAN_CONFIG                    FDCAN_CONFIG_NS
#define FDCAN_CONFIG_BASE               FDCAN_CONFIG_BASE_NS
#define FLASH                           FLASH_NS
#define FLASH_R_BASE                    FLASH_R_BASE_NS
#define GPDMA1                          GPDMA1_NS
#define GPDMA1_BASE                     GPDMA1_BASE_NS
#define GPDMA1_Channel0                 GPDMA1_Channel0_NS
#define GPDMA1_Channel0_BASE            GPDMA1_Channel0_BASE_NS
#define GPDMA1_Channel1                 GPDMA1_Channel1_NS
#define GPDMA1_Channel1_BASE            GPDMA1_Channel1_BASE_NS
#define GPDMA1_Channel2                 GPDMA1_Channel2_NS
#define GPDMA1_Channel2_BASE            GPDMA1_Channel2_BASE_NS
#define GPDMA1_Channel3                 GPDMA1_Channel3_NS
#define GPDMA1_Channel3_BASE            GPDMA1_Channel3_BASE_NS
#define GPDMA1_Channel4                 GPDMA1_Channel4_NS
#define GPDMA1_Channel4_BASE            GPDMA1_Channel4_BASE_NS
#define GPDMA1_Channel5                 GPDMA1_Channel5_NS
#define GPDMA1_Channel5_BASE            GPDMA1_Channel5_BASE_NS
#define GPDMA1_Channel6                 GPDMA1_Channel6_NS
#define GPDMA1_Channel6_BASE            GPDMA1_Channel6_BASE_NS
#define GPDMA1_Channel7                 GPDMA1_Channel7_NS
#define GPDMA1_Channel7_BASE            GPDMA1_Channel7_BASE_NS
#define GPDMA1_Channel8                 GPDMA1_Channel8_NS
#define GPDMA1_Channel8_BASE            GPDMA1_Channel8_BASE_NS
#define GPDMA1_Channel9                 GPDMA1_Channel9_NS
#define GPDMA1_Channel9_BASE            GPDMA1_Channel9_BASE_NS
#define GPDMA1_Channel10                GPDMA1_Channel10_NS
#define GPDMA1_Channel10_BASE           GPDMA1_Channel10_BASE_NS
#define GPDMA1_Channel11                GPDMA1_Channel11_NS
#define GPDMA1_Channel11_BASE           GPDMA1_Channel11_BASE_NS
#define GPIOA                           GPIOA_NS
#define GPIOA_BASE                      GPIOA_BASE_NS
#define GPIOB                           GPIOB_NS
#define GPIOB_BASE                      GPIOB_BASE_NS
#define GPIOC                           GPIOC_NS
#define GPIOC_BASE                      GPIOC_BASE_NS
#define GPIOD                           GPIOD_NS
#define GPIOD_BASE                      GPIOD_BASE_NS
#define GPIOE                           GPIOE_NS
#define GPIOE_BASE                      GPIOE_BASE_NS
#define GPIOG                           GPIOG_NS
#define GPIOG_BASE                      GPIOG_BASE_NS
#define GPIOH                           GPIOH_NS
#define GPIOH_BASE                      GPIOH_BASE_NS
#define GTZC_MPCBB1                     GTZC_MPCBB1_NS
#define GTZC_MPCBB1_BASE                GTZC_MPCBB1_BASE_NS
#define GTZC_MPCBB2                     GTZC_MPCBB2_NS
#define GTZC_MPCBB2_BASE                GTZC_MPCBB2_BASE_NS
#define GTZC_TZSC1                      GTZC_TZSC1_NS
#define GTZC_TZSC1_BASE                 GTZC_TZSC1_BASE_NS
#define HASH                            HASH_NS
#define HASH_BASE                       HASH_BASE_NS
#define HASH_DIGEST                     HASH_DIGEST_NS
#define HASH_DIGEST_BASE                HASH_DIGEST_BASE_NS
#define I2C1                            I2C1_NS
#define I2C1_BASE                       I2C1_BASE_NS
#define I2C2                            I2C2_NS
#define I2C2_BASE                       I2C2_BASE_NS
#define I2C3                            I2C3_NS
#define I2C3_BASE                       I2C3_BASE_NS
#define I3C1                            I3C1_NS
#define I3C1_BASE                       I3C1_BASE_NS
#define I3C2                            I3C2_NS
#define I3C2_BASE                       I3C2_BASE_NS
#define ICACHE                          ICACHE_NS
#define ICACHE_BASE                     ICACHE_BASE_NS
#define IWDG                            IWDG_NS
#define IWDG_BASE                       IWDG_BASE_NS
#define LPTIM1                          LPTIM1_NS
#define LPTIM1_BASE                     LPTIM1_BASE_NS
#define LPTIM2                          LPTIM2_NS
#define LPTIM2_BASE                     LPTIM2_BASE_NS
#define LPTIM3                          LPTIM3_NS
#define LPTIM3_BASE                     LPTIM3_BASE_NS
#define LPTIM4                          LPTIM4_NS
#define LPTIM4_BASE                     LPTIM4_BASE_NS
#define LPUART1                         LPUART1_NS
#define LPUART1_BASE                    LPUART1_BASE_NS
#define OCTOSPI1                        OCTOSPI1_NS
#define OCTOSPI1_R_BASE                 OCTOSPI1_R_BASE_NS
#define OPAMP1                          OPAMP1_NS
#define OPAMP1_BASE                     OPAMP1_BASE_NS
#define OPAMP2                          OPAMP2_NS
#define OPAMP2_BASE                     OPAMP2_BASE_NS
#define OPAMP12_COMMON                  OPAMP12_COMMON_NS
#define OPAMP12_COMMON_BASE             OPAMP12_COMMON_BASE_NS
#define PKA                             PKA_NS
#define PKA_BASE                        PKA_BASE_NS
#define PKA_RAM_BASE                    PKA_RAM_BASE_NS
#define PWR                             PWR_NS
#define PWR_BASE                        PWR_BASE_NS
#define RAMCFG_SRAM1                    RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE               RAMCFG_SRAM1_BASE_NS
#define RAMCFG_SRAM2                    RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE               RAMCFG_SRAM2_BASE_NS
#define RCC                             RCC_NS
#define RCC_BASE                        RCC_BASE_NS
#define RNG                             RNG_NS
#define RNG_BASE                        RNG_BASE_NS
#define RTC                             RTC_NS
#define RTC_BASE                        RTC_BASE_NS
#define SAI1                            SAI1_NS
#define SAI1_BASE                       SAI1_BASE_NS
#define SAI1_Block_A                    SAI1_Block_A_NS
#define SAI1_Block_A_BASE               SAI1_Block_A_BASE_NS
#define SAI1_Block_B                    SAI1_Block_B_NS
#define SAI1_Block_B_BASE               SAI1_Block_B_BASE_NS
#define SDMMC1                          SDMMC1_NS
#define SDMMC1_BASE                     SDMMC1_BASE_NS
#define SPI1                            SPI1_NS
#define SPI1_BASE                       SPI1_BASE_NS
#define SPI2                            SPI2_NS
#define SPI2_BASE                       SPI2_BASE_NS
#define SPI3                            SPI3_NS
#define SPI3_BASE                       SPI3_BASE_NS
#define SRAMCAN_BASE                    SRAMCAN_BASE_NS
#define SYSCFG                          SYSCFG_NS
#define SYSCFG_BASE                     SYSCFG_BASE_NS
#define TAMP                            TAMP_NS
#define TAMP_BASE                       TAMP_BASE_NS
#define TIM1                            TIM1_NS
#define TIM1_BASE                       TIM1_BASE_NS
#define TIM2                            TIM2_NS
#define TIM2_BASE                       TIM2_BASE_NS
#define TIM3                            TIM3_NS
#define TIM3_BASE                       TIM3_BASE_NS
#define TIM4                            TIM4_NS
#define TIM4_BASE                       TIM4_BASE_NS
#define TIM6                            TIM6_NS
#define TIM6_BASE                       TIM6_BASE_NS
#define TIM7                            TIM7_NS
#define TIM7_BASE                       TIM7_BASE_NS
#define TIM15                           TIM15_NS
#define TIM15_BASE                      TIM15_BASE_NS
#define TIM16                           TIM16_NS
#define TIM16_BASE                      TIM16_BASE_NS
#define TIM17                           TIM17_NS
#define TIM17_BASE                      TIM17_BASE_NS
#define TSC                             TSC_NS
#define TSC_BASE                        TSC_BASE_NS
#define UART4                           UART4_NS
#define UART4_BASE                      UART4_BASE_NS
#define UART5                           UART5_NS
#define UART5_BASE                      UART5_BASE_NS
#define USART1                          USART1_NS
#define USART1_BASE                     USART1_BASE_NS
#define USART3                          USART3_NS
#define USART3_BASE                     USART3_BASE_NS
#define USB_DRD_FS                      USB_DRD_FS_NS
#define USB_DRD_BASE                    USB_DRD_BASE_NS
#define USB_DRD_PMAADDR                 USB_DRD_PMAADDR_NS
#define USB_DRD_PMA_BUFF                USB_DRD_PMA_BUFF_NS
#define VREFBUF                         VREFBUF_NS
#define VREFBUF_BASE                    VREFBUF_BASE_NS
#define WWDG                            WWDG_NS
#define WWDG_BASE                       WWDG_BASE_NS
#endif /* CPU_IN_SECURE_STATE */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Hardware_Constant_Definition
  * @{
  */
#define LSI_STARTUP_TIME                16000U /*!< LSI Maximum startup time in us : 4 cycles @ 250 Hz = 16 ms */
/**
  * @}
  */

/** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter (ADC)                   */
/*                                                                            */
/******************************************************************************/

/* Specific device feature definitions */
#define ADC_MULTIMODE_SUPPORT         /*!< ADC feature available only on specific devices: multimode available on devices with several ADC instances */

