ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U3xx/stm32u375xx.h
/********************  Bit definition for RCC_CCIPR1 register  ******************/
#define RCC_CCIPR1_USART1SEL_Pos            (0UL)
#define RCC_CCIPR1_USART1SEL_Msk            (0x1UL << RCC_CCIPR1_USART1SEL_Pos)     /*!< 0x00000001 */
#define RCC_CCIPR1_USART1SEL                RCC_CCIPR1_USART1SEL_Msk                /*!< USART1SEL: USART1 Kernel Clock Source Selection */
#define RCC_CCIPR1_USART3SEL_Pos            (2UL)
#define RCC_CCIPR1_USART3SEL_Msk            (0x1UL << RCC_CCIPR1_USART3SEL_Pos)     /*!< 0x00000004 */
#define RCC_CCIPR1_USART3SEL                RCC_CCIPR1_USART3SEL_Msk                /*!< USART3SEL: USART3 Kernel Clock Source Selection */
#define RCC_CCIPR1_UART4SEL_Pos             (4UL)
#define RCC_CCIPR1_UART4SEL_Msk             (0x1UL << RCC_CCIPR1_UART4SEL_Pos)      /*!< 0x00000010 */
#define RCC_CCIPR1_UART4SEL                 RCC_CCIPR1_UART4SEL_Msk                 /*!< UART4SEL: UART4 Kernel Clock Source Selection */
#define RCC_CCIPR1_UART5SEL_Pos             (6UL)
#define RCC_CCIPR1_UART5SEL_Msk             (0x1UL << RCC_CCIPR1_UART5SEL_Pos)      /*!< 0x00000040 */
#define RCC_CCIPR1_UART5SEL                 RCC_CCIPR1_UART5SEL_Msk                 /*!< UART5SEL: UART5 Kernel Clock Source Selection */
#define RCC_CCIPR1_I3C1SEL_Pos              (8UL)
#define RCC_CCIPR1_I3C1SEL_Msk              (0x1UL << RCC_CCIPR1_I3C1SEL_Pos)       /*!< 0x00000100 */
#define RCC_CCIPR1_I3C1SEL                  RCC_CCIPR1_I3C1SEL_Msk                  /*!< I3C1SEL: I3C1 Kernel Clock Source Selection */
#define RCC_CCIPR1_I2C1SEL_Pos              (10UL)
#define RCC_CCIPR1_I2C1SEL_Msk              (0x1UL << RCC_CCIPR1_I2C1SEL_Pos)       /*!< 0x00000400 */
#define RCC_CCIPR1_I2C1SEL                  RCC_CCIPR1_I2C1SEL_Msk                  /*!< I2C1SEL: I2C1 Kernel Clock Source Selection */
#define RCC_CCIPR1_I2C2SEL_Pos              (12UL)
#define RCC_CCIPR1_I2C2SEL_Msk              (0x1UL << RCC_CCIPR1_I2C2SEL_Pos)       /*!< 0x00001000 */
#define RCC_CCIPR1_I2C2SEL                  RCC_CCIPR1_I2C2SEL_Msk                  /*!< I2C2SEL: I2C2 Kernel Clock Source Selection */
#define RCC_CCIPR1_I3C2SEL_Pos              (14UL)
#define RCC_CCIPR1_I3C2SEL_Msk              (0x1UL << RCC_CCIPR1_I3C2SEL_Pos)       /*!< 0x00004000 */
#define RCC_CCIPR1_I3C2SEL                  RCC_CCIPR1_I3C2SEL_Msk                  /*!< I3C2SEL: I3C2 Kernel Clock Source Selection */
#define RCC_CCIPR1_SPI2SEL_Pos              (16UL)
#define RCC_CCIPR1_SPI2SEL_Msk              (0x1UL << RCC_CCIPR1_SPI2SEL_Pos)       /*!< 0x00010000 */
#define RCC_CCIPR1_SPI2SEL                  RCC_CCIPR1_SPI2SEL_Msk                  /*!< SPI2SEL: SPI2 Kernel Clock Source Selection */
#define RCC_CCIPR1_LPTIM2SEL_Pos            (18UL)
#define RCC_CCIPR1_LPTIM2SEL_Msk            (0x3UL << RCC_CCIPR1_LPTIM2SEL_Pos)     /*!< 0x000C0000 */
#define RCC_CCIPR1_LPTIM2SEL                RCC_CCIPR1_LPTIM2SEL_Msk                /*!< LPTIM2SEL[1:0]: LPTIM2 Kernel Clock Source Selection */
#define RCC_CCIPR1_LPTIM2SEL_0              (0x1UL << RCC_CCIPR1_LPTIM2SEL_Pos)     /*!< 0x00040000 */
#define RCC_CCIPR1_LPTIM2SEL_1              (0x2UL << RCC_CCIPR1_LPTIM2SEL_Pos)     /*!< 0x00080000 */
#define RCC_CCIPR1_SPI1SEL_Pos              (20UL)
#define RCC_CCIPR1_SPI1SEL_Msk              (0x1UL << RCC_CCIPR1_SPI1SEL_Pos)       /*!< 0x00100000 */
#define RCC_CCIPR1_SPI1SEL                  RCC_CCIPR1_SPI1SEL_Msk                  /*!< SPI1SEL:  SPI1 Kernel Clock Source Selection */
#define RCC_CCIPR1_SYSTICKSEL_Pos           (22UL)
#define RCC_CCIPR1_SYSTICKSEL_Msk           (0x3UL << RCC_CCIPR1_SYSTICKSEL_Pos)    /*!< 0x00C00000 */
#define RCC_CCIPR1_SYSTICKSEL               RCC_CCIPR1_SYSTICKSEL_Msk               /*!< SYSTICKSEL[1:0]: SYSTICK Clock Source Selection */
#define RCC_CCIPR1_SYSTICKSEL_0             (0x1UL << RCC_CCIPR1_SYSTICKSEL_Pos)    /*!< 0x00400000 */
#define RCC_CCIPR1_SYSTICKSEL_1             (0x2UL << RCC_CCIPR1_SYSTICKSEL_Pos)    /*!< 0x00800000 */
#define RCC_CCIPR1_FDCANSEL_Pos             (24UL)
#define RCC_CCIPR1_FDCANSEL_Msk             (0x1UL << RCC_CCIPR1_FDCANSEL_Pos)     /*!< 0x01000000 */
#define RCC_CCIPR1_FDCANSEL                 RCC_CCIPR1_FDCANSEL_Msk               /*!< FDCANSEL: FDCAN1 Kernel Clock Source Selection */
#define RCC_CCIPR1_FDCAN1SEL_Pos            RCC_CCIPR1_FDCANSEL_Pos
#define RCC_CCIPR1_FDCAN1SEL_Msk            RCC_CCIPR1_FDCANSEL_Msk
#define RCC_CCIPR1_FDCAN1SEL                RCC_CCIPR1_FDCANSEL
#define RCC_CCIPR1_ICLKSEL_Pos              (26UL)
#define RCC_CCIPR1_ICLKSEL_Msk              (0x3UL << RCC_CCIPR1_ICLKSEL_Pos)       /*!< 0x0C000000 */
#define RCC_CCIPR1_ICLKSEL                  RCC_CCIPR1_ICLKSEL_Msk                  /*!< ICLKSEL[1:0]: Intermediate Clock Source Selection */
#define RCC_CCIPR1_ICLKSEL_0                (0x1UL << RCC_CCIPR1_ICLKSEL_Pos)       /*!< 0x04000000 */
#define RCC_CCIPR1_ICLKSEL_1                (0x2UL << RCC_CCIPR1_ICLKSEL_Pos)       /*!< 0x08000000 */
#define RCC_CCIPR1_USB1SEL_Pos              (28UL)
#define RCC_CCIPR1_USB1SEL_Msk              (0x1UL << RCC_CCIPR1_USB1SEL_Pos)       /*!< 0x10000000 */
#define RCC_CCIPR1_USB1SEL                  RCC_CCIPR1_USB1SEL_Msk                  /*!< USB1SEL: USB1 Kernel Clock Source Selection */
#define RCC_CCIPR1_TIMICSEL_Pos             (29UL)
#define RCC_CCIPR1_TIMICSEL_Msk             (0x7UL << RCC_CCIPR1_TIMICSEL_Pos)      /*!< 0xE0000000 */
#define RCC_CCIPR1_TIMICSEL                 RCC_CCIPR1_TIMICSEL_Msk                 /*!< TIMICSEL[2:0]: TIM16, TIM17 and LPTIM2 Internal Input Capture Kernel Clock Source Selection */
#define RCC_CCIPR1_TIMICSEL_0               (0x1UL << RCC_CCIPR1_TIMICSEL_Pos)      /*!< 0x20000000 */
#define RCC_CCIPR1_TIMICSEL_1               (0x2UL << RCC_CCIPR1_TIMICSEL_Pos)      /*!< 0x40000000 */
#define RCC_CCIPR1_TIMICSEL_2               (0x4UL << RCC_CCIPR1_TIMICSEL_Pos)      /*!< 0x80000000 */

/********************  Bit definition for RCC_CCIPR2 register  ******************/
#define RCC_CCIPR2_ADF1SEL_Pos              (0UL)
#define RCC_CCIPR2_ADF1SEL_Msk              (0x3UL << RCC_CCIPR2_ADF1SEL_Pos)       /*!< 0x00000003 */
#define RCC_CCIPR2_ADF1SEL                  RCC_CCIPR2_ADF1SEL_Msk                  /*!< ADF1SEL[1:0]: ADF Kernel Clock Source Selection */
#define RCC_CCIPR2_ADF1SEL_0                (0x1UL << RCC_CCIPR2_ADF1SEL_Pos)       /*!< 0x00000001 */
#define RCC_CCIPR2_ADF1SEL_1                (0x2UL << RCC_CCIPR2_ADF1SEL_Pos)       /*!< 0x00000002 */
#define RCC_CCIPR2_SPI3SEL_Pos              (3UL)
#define RCC_CCIPR2_SPI3SEL_Msk              (0x1UL << RCC_CCIPR2_SPI3SEL_Pos)       /*!< 0x00000004 */
#define RCC_CCIPR2_SPI3SEL                  RCC_CCIPR2_SPI3SEL_Msk                  /*!< SPI3SEL: SPI3 Kernel Clock Source Selection */
#define RCC_CCIPR2_SAI1SEL_Pos              (5UL)
#define RCC_CCIPR2_SAI1SEL_Msk              (0x3UL << RCC_CCIPR2_SAI1SEL_Pos)       /*!< 0x00000060 */
#define RCC_CCIPR2_SAI1SEL                  RCC_CCIPR2_SAI1SEL_Msk                  /*!< SAI1SEL[1:0]: SAI1 Kernel Clock Source Selection */
#define RCC_CCIPR2_SAI1SEL_0                (0x1UL << RCC_CCIPR2_SAI1SEL_Pos)       /*!< 0x00000020 */
#define RCC_CCIPR2_SAI1SEL_1                (0x2UL << RCC_CCIPR2_SAI1SEL_Pos)       /*!< 0x00000040 */
#define RCC_CCIPR2_RNGSEL_Pos               (11UL)
#define RCC_CCIPR2_RNGSEL_Msk               (0x1UL << RCC_CCIPR2_RNGSEL_Pos)        /*!< 0x00000800 */
#define RCC_CCIPR2_RNGSEL                   RCC_CCIPR2_RNGSEL_Msk                   /*!< RNGSEL: RNG Kernel Clock Source Selection */
#define RCC_CCIPR2_ADCDACPRE_Pos            (12UL)
#define RCC_CCIPR2_ADCDACPRE_Msk            (0xFUL << RCC_CCIPR2_ADCDACPRE_Pos)     /*!< 0x0000F000 */
#define RCC_CCIPR2_ADCDACPRE                RCC_CCIPR2_ADCDACPRE_Msk                /*!< ADCDACPRE[3:0]: ADC/DAC prescaler */
#define RCC_CCIPR2_ADCDACPRE_0              (0x1UL << RCC_CCIPR2_ADCDACPRE_Pos)     /*!< 0x00001000 */
#define RCC_CCIPR2_ADCDACPRE_1              (0x2UL << RCC_CCIPR2_ADCDACPRE_Pos)     /*!< 0x00002000 */
#define RCC_CCIPR2_ADCDACPRE_2              (0x4UL << RCC_CCIPR2_ADCDACPRE_Pos)     /*!< 0x00004000 */
#define RCC_CCIPR2_ADCDACPRE_3              (0x8UL << RCC_CCIPR2_ADCDACPRE_Pos)     /*!< 0x00008000 */
#define RCC_CCIPR2_ADCDACSEL_Pos            (16UL)
#define RCC_CCIPR2_ADCDACSEL_Msk            (0x3UL << RCC_CCIPR2_ADCDACSEL_Pos)     /*!< 0x00030000 */
#define RCC_CCIPR2_ADCDACSEL                RCC_CCIPR2_ADCDACSEL_Msk                /*!< ADCDACSEL[2:0]: ADC1 and DAC1 Kernel Clock Source Selection */
#define RCC_CCIPR2_ADCDACSEL_0              (0x1UL << RCC_CCIPR2_ADCDACSEL_Pos)     /*!< 0x00010000 */
#define RCC_CCIPR2_ADCDACSEL_1              (0x2UL << RCC_CCIPR2_ADCDACSEL_Pos)     /*!< 0x00020000 */
#define RCC_CCIPR2_DAC1SHSEL_Pos            (19UL)
#define RCC_CCIPR2_DAC1SHSEL_Msk            (0x1UL << RCC_CCIPR2_DAC1SHSEL_Pos)     /*!< 0x00080000 */
#define RCC_CCIPR2_DAC1SHSEL                RCC_CCIPR2_DAC1SHSEL_Msk                /*!< DACSEL: DAC1 Sample and Hold Clock Source Selection */
#define RCC_CCIPR2_OCTOSPISEL_Pos           (20UL)
#define RCC_CCIPR2_OCTOSPISEL_Msk           (0x1UL << RCC_CCIPR2_OCTOSPISEL_Pos)    /*!< 0x00100000 */
#define RCC_CCIPR2_OCTOSPISEL               RCC_CCIPR2_OCTOSPISEL_Msk               /*!< OCTOSPISEL: OCTOSPI1 Kernel Clock Source Selection */

/********************  Bit definition for RCC_CCIPR3 register  ***************/
#define RCC_CCIPR3_LPUART1SEL_Pos           (0UL)
#define RCC_CCIPR3_LPUART1SEL_Msk           (0x3UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x00000003 */
#define RCC_CCIPR3_LPUART1SEL               RCC_CCIPR3_LPUART1SEL_Msk               /*!< LPUART1SEL[1:0]: LPUART1 Kernel Clock Source Selection */
#define RCC_CCIPR3_LPUART1SEL_0             (0x1UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x00000001 */
#define RCC_CCIPR3_LPUART1SEL_1             (0x2UL << RCC_CCIPR3_LPUART1SEL_Pos)    /*!< 0x00000002 */
#define RCC_CCIPR3_I2C3SEL_Pos              (6UL)
#define RCC_CCIPR3_I2C3SEL_Msk              (0x1UL << RCC_CCIPR3_I2C3SEL_Pos)       /*!< 0x00000040 */
#define RCC_CCIPR3_I2C3SEL                  RCC_CCIPR3_I2C3SEL_Msk                  /*!< I2C3SEL: I2C3 Kernel Clock Source Selection */
#define RCC_CCIPR3_LPTIM34SEL_Pos           (8UL)
#define RCC_CCIPR3_LPTIM34SEL_Msk           (0x3UL << RCC_CCIPR3_LPTIM34SEL_Pos)    /*!< 0x00000300 */
#define RCC_CCIPR3_LPTIM34SEL               RCC_CCIPR3_LPTIM34SEL_Msk               /*!< LPTIM34SEL[1:0]: LPTIM3 and LPTIM4 Kernel Clock Source Selection */
#define RCC_CCIPR3_LPTIM34SEL_0             (0x1UL << RCC_CCIPR3_LPTIM34SEL_Pos)    /*!< 0x00000100 */
#define RCC_CCIPR3_LPTIM34SEL_1             (0x2UL << RCC_CCIPR3_LPTIM34SEL_Pos)    /*!< 0x00000200 */
#define RCC_CCIPR3_LPTIM1SEL_Pos            (10UL)
#define RCC_CCIPR3_LPTIM1SEL_Msk            (0x3UL << RCC_CCIPR3_LPTIM1SEL_Pos)     /*!< 0x00000C00 */
#define RCC_CCIPR3_LPTIM1SEL                RCC_CCIPR3_LPTIM1SEL_Msk                /*!< LPTIM1SEL[1:0]: LPTIM1 Kernel Clock Source Selection */
#define RCC_CCIPR3_LPTIM1SEL_0              (0x1UL << RCC_CCIPR3_LPTIM1SEL_Pos)     /*!< 0x00000400 */
#define RCC_CCIPR3_LPTIM1SEL_1              (0x2UL << RCC_CCIPR3_LPTIM1SEL_Pos)     /*!< 0x00000800 */

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos                  (0UL)
#define RCC_BDCR_LSEON_Msk                  (0x1UL << RCC_BDCR_LSEON_Pos)           /*!< 0x00000001 */
#define RCC_BDCR_LSEON                      RCC_BDCR_LSEON_Msk                      /*!< LSE Oscillator Enable */
#define RCC_BDCR_LSERDY_Pos                 (1UL)
#define RCC_BDCR_LSERDY_Msk                 (0x1UL << RCC_BDCR_LSERDY_Pos)          /*!< 0x00000002 */
#define RCC_BDCR_LSERDY                     RCC_BDCR_LSERDY_Msk                     /*!< LSE Oscillator Ready */
#define RCC_BDCR_LSEBYP_Pos                 (2UL)
#define RCC_BDCR_LSEBYP_Msk                 (0x1UL << RCC_BDCR_LSEBYP_Pos)          /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP                     RCC_BDCR_LSEBYP_Msk                     /*!< LSE Oscillator Bypass */
#define RCC_BDCR_LSEDRV_Pos                 (3UL)
#define RCC_BDCR_LSEDRV_Msk                 (0x3UL << RCC_BDCR_LSEDRV_Pos)          /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV                     RCC_BDCR_LSEDRV_Msk                     /*!< LSEDRV[1:0]: LSE Oscillator Drive Capability */
#define RCC_BDCR_LSEDRV_0                   (0x1UL << RCC_BDCR_LSEDRV_Pos)          /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1                   (0x2UL << RCC_BDCR_LSEDRV_Pos)          /*!< 0x00000010 */
#define RCC_BDCR_LSECSSON_Pos               (5UL)
#define RCC_BDCR_LSECSSON_Msk               (0x1UL << RCC_BDCR_LSECSSON_Pos)        /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON                   RCC_BDCR_LSECSSON_Msk                   /*!< CSS on LSE Enable */
#define RCC_BDCR_LSECSSD_Pos                (6UL)
#define RCC_BDCR_LSECSSD_Msk                (0x1UL << RCC_BDCR_LSECSSD_Pos)         /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                    RCC_BDCR_LSECSSD_Msk                    /*!< CSS on LSE failure Detection */
#define RCC_BDCR_LSESYSEN_Pos               (7UL)
#define RCC_BDCR_LSESYSEN_Msk               (0x1UL << RCC_BDCR_LSESYSEN_Pos)        /*!< 0x00000080 */
#define RCC_BDCR_LSESYSEN                   RCC_BDCR_LSESYSEN_Msk                   /*!< LSE System Clock (LSESYS) Enable */
#define RCC_BDCR_RTCSEL_Pos                 (8UL)
#define RCC_BDCR_RTCSEL_Msk                 (0x3UL << RCC_BDCR_RTCSEL_Pos)          /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                     RCC_BDCR_RTCSEL_Msk                     /*!< RTCSEL[1:0]: RTC Clock Source Selection */
#define RCC_BDCR_RTCSEL_0                   (0x1UL << RCC_BDCR_RTCSEL_Pos)          /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                   (0x2UL << RCC_BDCR_RTCSEL_Pos)          /*!< 0x00000200 */
#define RCC_BDCR_LSESYSRDY_Pos              (11UL)
#define RCC_BDCR_LSESYSRDY_Msk              (0x1UL << RCC_BDCR_LSESYSRDY_Pos)       /*!< 0x00000800 */
#define RCC_BDCR_LSESYSRDY                  RCC_BDCR_LSESYSRDY_Msk                  /*!< LSE System Clock (LSESYS) Ready */
#define RCC_BDCR_LSEGFON_Pos                (12UL)
#define RCC_BDCR_LSEGFON_Msk                (0x1UL << RCC_BDCR_LSEGFON_Pos)         /*!< 0x00001000 */
#define RCC_BDCR_LSEGFON                    RCC_BDCR_LSEGFON_Msk                    /*!< LSE Clock Glitch Filter Enable */
#define RCC_BDCR_RTCEN_Pos                  (15UL)
#define RCC_BDCR_RTCEN_Msk                  (0x1UL << RCC_BDCR_RTCEN_Pos)           /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                      RCC_BDCR_RTCEN_Msk                      /*!< RTC Clock Enable */
#define RCC_BDCR_BDRST_Pos                  (16UL)
#define RCC_BDCR_BDRST_Msk                  (0x1UL << RCC_BDCR_BDRST_Pos)           /*!< 0x00010000 */
#define RCC_BDCR_BDRST                      RCC_BDCR_BDRST_Msk                      /*!< BD reset */
#define RCC_BDCR_LSCOEN_Pos                 (24UL)
#define RCC_BDCR_LSCOEN_Msk                 (0x1UL << RCC_BDCR_LSCOEN_Pos)          /*!< 0x01000000 */
#define RCC_BDCR_LSCOEN                     RCC_BDCR_LSCOEN_Msk                     /*!< Low-speed Clock Output (LSCO) Enable */
#define RCC_BDCR_LSCOSEL_Pos                (25UL)
#define RCC_BDCR_LSCOSEL_Msk                (0x1UL << RCC_BDCR_LSCOSEL_Pos)         /*!< 0x02000000 */
#define RCC_BDCR_LSCOSEL                    RCC_BDCR_LSCOSEL_Msk                    /*!< Low-speed Clock Output Selection */

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                   (0UL)
#define RCC_CSR_LSION_Msk                   (0x1UL << RCC_CSR_LSION_Pos)            /*!< 0x00000001 */
#define RCC_CSR_LSION                       RCC_CSR_LSION_Msk                       /*!< LSI Oscillator Enable */
#define RCC_CSR_LSIRDY_Pos                  (1UL)
#define RCC_CSR_LSIRDY_Msk                  (0x1UL << RCC_CSR_LSIRDY_Pos)           /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                      RCC_CSR_LSIRDY_Msk                      /*!< LSI Oscillator Ready */
#define RCC_CSR_LSIPREDIV_Pos               (2UL)
#define RCC_CSR_LSIPREDIV_Msk               (0x1UL << RCC_CSR_LSIPREDIV_Pos)        /*!< 0x00000004 */
#define RCC_CSR_LSIPREDIV                   RCC_CSR_LSIPREDIV_Msk                   /*!< LSI clock divider selection */
#define RCC_CSR_MSIKDIVS_Pos                (8UL)
#define RCC_CSR_MSIKDIVS_Msk                (0x3UL << RCC_CSR_MSIKDIVS_Pos)         /*!< 0x00000300 */
#define RCC_CSR_MSIKDIVS                    RCC_CSR_MSIKDIVS_Msk                    /*!< MSIKDIVS[1:0]: MSIK Range After Standby Mode */
#define RCC_CSR_MSIKDIVS_0                  (0x1UL << RCC_CSR_MSIKDIVS_Pos)         /*!< 0x00000100 */
#define RCC_CSR_MSIKDIVS_1                  (0x2UL << RCC_CSR_MSIKDIVS_Pos)         /*!< 0x00000200 */
#define RCC_CSR_MSISDIVS_Pos                (12UL)
#define RCC_CSR_MSISDIVS_Msk                (0x3UL << RCC_CSR_MSISDIVS_Pos)         /*!< 0x00003000 */
#define RCC_CSR_MSISDIVS                    RCC_CSR_MSISDIVS_Msk                    /*!< MSISDIVS[1:0]: MSIS Range After Standby Mode */
#define RCC_CSR_MSISDIVS_0                  (0x1UL << RCC_CSR_MSISDIVS_Pos)         /*!< 0x00001000 */
#define RCC_CSR_MSISDIVS_1                  (0x2UL << RCC_CSR_MSISDIVS_Pos)         /*!< 0x00002000 */
#define RCC_CSR_RMVF_Pos                    (23UL)
#define RCC_CSR_RMVF_Msk                    (0x1UL << RCC_CSR_RMVF_Pos)             /*!< 0x00800000 */
#define RCC_CSR_RMVF                        RCC_CSR_RMVF_Msk                        /*!< Remove Reset Flag */
#define RCC_CSR_OBLRSTF_Pos                 (25UL)
#define RCC_CSR_OBLRSTF_Msk                 (0x1UL << RCC_CSR_OBLRSTF_Pos)          /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                     RCC_CSR_OBLRSTF_Msk                     /*!< Option Byte Loader Reset Flag */
#define RCC_CSR_PINRSTF_Pos                 (26UL)
#define RCC_CSR_PINRSTF_Msk                 (0x1UL << RCC_CSR_PINRSTF_Pos)          /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                     RCC_CSR_PINRSTF_Msk                     /*!< NRST Pin Reset Flag */
#define RCC_CSR_BORRSTF_Pos                 (27UL)
#define RCC_CSR_BORRSTF_Msk                 (0x1UL << RCC_CSR_BORRSTF_Pos)          /*!< 0x08000000 */
#define RCC_CSR_BORRSTF                     RCC_CSR_BORRSTF_Msk                     /*!< BOR Flag */
#define RCC_CSR_SFTRSTF_Pos                 (28UL)
#define RCC_CSR_SFTRSTF_Msk                 (0x1UL << RCC_CSR_SFTRSTF_Pos)          /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                     RCC_CSR_SFTRSTF_Msk                     /*!< Software Reset Flag */
#define RCC_CSR_IWDGRSTF_Pos                (29UL)
#define RCC_CSR_IWDGRSTF_Msk                (0x1UL << RCC_CSR_IWDGRSTF_Pos)         /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                    RCC_CSR_IWDGRSTF_Msk                    /*!< Independent Watchdog Reset Flag */
#define RCC_CSR_WWDGRSTF_Pos                (30UL)
#define RCC_CSR_WWDGRSTF_Msk                (0x1UL << RCC_CSR_WWDGRSTF_Pos)         /*!< 0x40000000 */
#define RCC_CSR_WWDGRSTF                    RCC_CSR_WWDGRSTF_Msk                    /*!< Window Watchdog Reset Flag */
#define RCC_CSR_LPWRRSTF_Pos                (31UL)
#define RCC_CSR_LPWRRSTF_Msk                (0x1UL << RCC_CSR_LPWRRSTF_Pos)         /*!< 0x80000000 */
#define RCC_CSR_LPWRRSTF                    RCC_CSR_LPWRRSTF_Msk                    /*!< Low-power Reset Flag */

/********************  Bit definition for RCC_SECCFGR register  **************/
#define RCC_SECCFGR_HSISEC_Pos              (0UL)
#define RCC_SECCFGR_HSISEC_Msk              (0x1UL << RCC_SECCFGR_HSISEC_Pos)       /*!< 0x00000001 */
#define RCC_SECCFGR_HSISEC                  RCC_SECCFGR_HSISEC_Msk                  /*!< HSI Clock Configuration and Status Bits Security */
#define RCC_SECCFGR_HSESEC_Pos              (1UL)
#define RCC_SECCFGR_HSESEC_Msk              (0x1UL << RCC_SECCFGR_HSESEC_Pos)       /*!< 0x00000002 */
#define RCC_SECCFGR_HSESEC                  RCC_SECCFGR_HSESEC_Msk                  /*!< HSE Clock Configuration Bits, Status Bits and HSE_CSS Security */
#define RCC_SECCFGR_MSISEC_Pos              (2UL)
#define RCC_SECCFGR_MSISEC_Msk              (0x1UL << RCC_SECCFGR_MSISEC_Pos)       /*!< 0x00000004 */
#define RCC_SECCFGR_MSISEC                  RCC_SECCFGR_MSISEC_Msk                  /*!< MSI Clock Configuration and Status Bits Security */
#define RCC_SECCFGR_LSISEC_Pos              (3UL)
#define RCC_SECCFGR_LSISEC_Msk              (0x1UL << RCC_SECCFGR_LSISEC_Pos)       /*!< 0x00000008 */
#define RCC_SECCFGR_LSISEC                  RCC_SECCFGR_LSISEC_Msk                  /*!< LSI Clock Configuration and Status Bits Security */
#define RCC_SECCFGR_LSESEC_Pos              (4UL)
#define RCC_SECCFGR_LSESEC_Msk              (0x1UL << RCC_SECCFGR_LSESEC_Pos)       /*!< 0x00000010 */
#define RCC_SECCFGR_LSESEC                  RCC_SECCFGR_LSESEC_Msk                  /*!< LSE Clock Configuration and Status Bits Security */
#define RCC_SECCFGR_SYSCLKSEC_Pos           (5UL)
#define RCC_SECCFGR_SYSCLKSEC_Msk           (0x1UL << RCC_SECCFGR_SYSCLKSEC_Pos)    /*!< 0x00000020 */
#define RCC_SECCFGR_SYSCLKSEC               RCC_SECCFGR_SYSCLKSEC_Msk               /*!< SYSCLK Clock Selection, STOPWUCK bit, Clock Output on MCO Configuration Security */
#define RCC_SECCFGR_PRESCSEC_Pos            (6UL)
#define RCC_SECCFGR_PRESCSEC_Msk            (0x1UL << RCC_SECCFGR_PRESCSEC_Pos)     /*!< 0x00000040 */
#define RCC_SECCFGR_PRESCSEC                RCC_SECCFGR_PRESCSEC_Msk                /*!< AHBx/APBx Prescaler Configuration Bits Security */
#define RCC_SECCFGR_BOOSTSEC_Pos            (7UL)
#define RCC_SECCFGR_BOOSTSEC_Msk            (0x1UL << RCC_SECCFGR_BOOSTSEC_Pos)     /*!< 0x00000080 */
#define RCC_SECCFGR_BOOSTSEC                RCC_SECCFGR_BOOSTSEC_Msk                /*!< BOOST Configuration Bits Security */
#define RCC_SECCFGR_ICLKSEC_Pos             (10UL)
#define RCC_SECCFGR_ICLKSEC_Msk             (0x1UL << RCC_SECCFGR_ICLKSEC_Pos)      /*!< 0x00000400 */
#define RCC_SECCFGR_ICLKSEC                 RCC_SECCFGR_ICLKSEC_Msk                 /*!< 48 MHz Clock Source Selection Security */
#define RCC_SECCFGR_HSI48SEC_Pos            (11UL)
#define RCC_SECCFGR_HSI48SEC_Msk            (0x1UL << RCC_SECCFGR_HSI48SEC_Pos)     /*!< 0x00000800 */
#define RCC_SECCFGR_HSI48SEC                RCC_SECCFGR_HSI48SEC_Msk                /*!< HSI48 Clock Configuration and Status Bits Security */
#define RCC_SECCFGR_RMVFSEC_Pos             (12UL)
#define RCC_SECCFGR_RMVFSEC_Msk             (0x1UL << RCC_SECCFGR_RMVFSEC_Pos)      /*!< 0x00001000 */
#define RCC_SECCFGR_RMVFSEC                 RCC_SECCFGR_RMVFSEC_Msk                 /*!< Remove Reset Flag Security */

/********************  Bit definition for RCC_PRIVCFGR register  **************/
#define RCC_PRIVCFGR_SPRIV_Pos              (0UL)
#define RCC_PRIVCFGR_SPRIV_Msk              (0x1UL << RCC_PRIVCFGR_SPRIV_Pos)       /*!< 0x00000001 */
#define RCC_PRIVCFGR_SPRIV                  RCC_PRIVCFGR_SPRIV_Msk                  /*!< RCC Secure Functions Privilege Configuration */
#define RCC_PRIVCFGR_NSPRIV_Pos             (1UL)
#define RCC_PRIVCFGR_NSPRIV_Msk             (0x1UL << RCC_PRIVCFGR_NSPRIV_Pos)      /*!< 0x00000002 */
#define RCC_PRIVCFGR_NSPRIV                 RCC_PRIVCFGR_NSPRIV_Msk                 /*!< RCC Non-Secure Functions Privilege Configuration */

